using System;

namespace Hometask3
{
    //Розробити додаток «Прайс-лист», яке формує список носіїв інформації,
    // - Flash-пам'ять,
    // - DVD - диск,
    // - знімний HDD.
    // Кожен носій інформації є об'єктом відповідного класу:
    // - Клас Flash - пам'ять;
    // - Клас DVD - диск;
    // - Клас знімний HDD.
    // Всі три класи є похідними від абстрактного класу «Носій інформації».
    // Базовий клас містить наступні поля: найменування носія, ім'я виробника, модель, кількість, ціна.
    // Клас має всі необхідні властивості для доступу до полів, а також віртуальними методами:
    // друку, імітація завантаження з файлу і збереження в файл. У похідних класах перевизначаються методи друку, завантаження і збереження.
    // Крім того, кожен з похідних класів доповнюється такими полями:
    // - Клас Flash-пам'ять: обсяг пам'яті, швидкість USB;
    // - Клас знімний HDD: розмір диска, швидкість USB;
    // - Клас DVD - диск: швидкість читання і швидкість запису.
    // Робота з об'єктами відповідних класів проводиться через посилання на базовий клас, які зберігаються в списку.
    // Додаток має надавати такі можливості:
    // - додавання носія інформації в список;
    // - видалення носія інформації зі списку по заданому критерію;
    // - друк списку;
    // - зміна певних параметрів носія інформації;
    // - пошук носія інформації за заданим критерієм;

    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
