using System;

namespace Hometask4
{

    //        Завдання 1 (Інтерфейси)
    //Розробити інтерфейс IVehicle(транспортний засіб).
    //На його основі реалізувати класи Plane(літак) Car(автомобіль)  Ship(судно).
    //Класи повинні мати можливість задавати і отримувати координати і параметри засобів пересування
    //(вартість, швидкість, рік випуску і т.д.) за допомогою властивостей і оголосити їх в інтерфейсі.
    //Для літака повинна бути визначена висота, для літака і судна – кількість пасажирів, для судна – порт приписки.
    //Динамічні характеристики задавати за допомогою методів.
    //Створити метод для роздруківки стану транспортного засобу (кількість пасажир, порт, аеропорт і т.д.)

    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
